balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F85J90.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDSE0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="LCDSE0" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDSE0" edc:desc="" edc:mask="0xff" edc:name="LCDSE0" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SE0" edc:desc="" edc:mask="0x1" edc:name="SE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE1" edc:desc="" edc:mask="0x1" edc:name="SE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE2" edc:desc="" edc:mask="0x1" edc:name="SE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE3" edc:desc="" edc:mask="0x1" edc:name="SE3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE4" edc:desc="" edc:mask="0x1" edc:name="SE4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE5" edc:desc="" edc:mask="0x1" edc:name="SE5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE6" edc:desc="" edc:mask="0x1" edc:name="SE6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE7" edc:desc="" edc:mask="0x1" edc:name="SE7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEGEN0" edc:desc="" edc:mask="0x1" edc:name="SEGEN0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEGEN1" edc:desc="" edc:mask="0x1" edc:name="SEGEN1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEGEN2" edc:desc="" edc:mask="0x1" edc:name="SEGEN2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEGEN3" edc:desc="" edc:mask="0x1" edc:name="SEGEN3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEGEN4" edc:desc="" edc:mask="0x1" edc:name="SEGEN4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEGEN5" edc:desc="" edc:mask="0x1" edc:name="SEGEN5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEGEN6" edc:desc="" edc:mask="0x1" edc:name="SEGEN6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEGEN7" edc:desc="" edc:mask="0x1" edc:name="SEGEN7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="SE00" edc:desc="" edc:mask="0x1" edc:name="SE00" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE01" edc:desc="" edc:mask="0x1" edc:name="SE01" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE02" edc:desc="" edc:mask="0x1" edc:name="SE02" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE03" edc:desc="" edc:mask="0x1" edc:name="SE03" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE04" edc:desc="" edc:mask="0x1" edc:name="SE04" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE05" edc:desc="" edc:mask="0x1" edc:name="SE05" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE06" edc:desc="" edc:mask="0x1" edc:name="SE06" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE07" edc:desc="" edc:mask="0x1" edc:name="SE07" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDPS" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="LCDPS" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LP" edc:desc="" edc:mask="0xf" edc:name="LP" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="WA" edc:desc="" edc:mask="0x1" edc:name="WA" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LCDA" edc:desc="" edc:mask="0x1" edc:name="LCDA" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BIASMD" edc:desc="" edc:mask="0x1" edc:name="BIASMD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WFT" edc:desc="" edc:mask="0x1" edc:name="WFT" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LCDPS0" edc:desc="" edc:mask="0x1" edc:name="LCDPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LCDPS1" edc:desc="" edc:mask="0x1" edc:name="LCDPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LCDPS2" edc:desc="" edc:mask="0x1" edc:name="LCDPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LCDPS3" edc:desc="" edc:mask="0x1" edc:name="LCDPS3" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="LP0" edc:desc="" edc:mask="0x1" edc:name="LP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LP1" edc:desc="" edc:mask="0x1" edc:name="LP1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LP2" edc:desc="" edc:mask="0x1" edc:name="LP2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LP3" edc:desc="" edc:mask="0x1" edc:name="LP3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnrrr" edc:cname="RCSTA1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000x" edc:name="RCSTA1" edc:nzwidth="0x8" edc:por="0000000x">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="RCSTA"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RX9D" edc:desc="" edc:mask="0x1" edc:name="RX9D" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OERR" edc:desc="" edc:mask="0x1" edc:name="OERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FERR" edc:desc="" edc:mask="0x1" edc:name="FERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADDEN" edc:desc="" edc:mask="0x1" edc:name="ADDEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CREN" edc:desc="" edc:mask="0x1" edc:name="CREN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SREN" edc:desc="" edc:mask="0x1" edc:name="SREN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RX9" edc:desc="" edc:mask="0x1" edc:name="RX9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPEN" edc:desc="" edc:mask="0x1" edc:name="SPEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RCD8" edc:desc="" edc:mask="0x1" edc:name="RCD8" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RC9" edc:desc="" edc:mask="0x1" edc:name="RC9" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="nRC8" edc:desc="" edc:mask="0x1" edc:name="nRC8" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="RC8_9" edc:desc="" edc:mask="0x1" edc:name="RC8_9" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.3">
              <edc:SFRFieldDef edc:cname="RX9D1" edc:desc="" edc:mask="0x1" edc:name="RX9D1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OERR1" edc:desc="" edc:mask="0x1" edc:name="OERR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FERR1" edc:desc="" edc:mask="0x1" edc:name="FERR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADDEN1" edc:desc="" edc:mask="0x1" edc:name="ADDEN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CREN1" edc:desc="" edc:mask="0x1" edc:name="CREN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SREN1" edc:desc="" edc:mask="0x1" edc:name="SREN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RX91" edc:desc="" edc:mask="0x1" edc:name="RX91" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPEN1" edc:desc="" edc:mask="0x1" edc:name="SPEN1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
