balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F85J90.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CVRCON" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CVRCON" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CVR" edc:desc="" edc:mask="0xf" edc:name="CVR" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="CVRSS" edc:desc="" edc:mask="0x1" edc:name="CVRSS" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CVRR" edc:desc="" edc:mask="0x1" edc:name="CVRR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CVROE" edc:desc="" edc:mask="0x1" edc:name="CVROE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CVREN" edc:desc="" edc:mask="0x1" edc:name="CVREN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CVR0" edc:desc="" edc:mask="0x1" edc:name="CVR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CVR1" edc:desc="" edc:mask="0x1" edc:name="CVR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CVR2" edc:desc="" edc:mask="0x1" edc:name="CVR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CVR3" edc:desc="" edc:mask="0x1" edc:name="CVR3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDSE1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDSE1" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDSE1" edc:desc="" edc:mask="0xff" edc:name="LCDSE1" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SE8" edc:desc="" edc:mask="0x1" edc:name="SE8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE9" edc:desc="" edc:mask="0x1" edc:name="SE9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE10" edc:desc="" edc:mask="0x1" edc:name="SE10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE11" edc:desc="" edc:mask="0x1" edc:name="SE11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE12" edc:desc="" edc:mask="0x1" edc:name="SE12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE13" edc:desc="" edc:mask="0x1" edc:name="SE13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE14" edc:desc="" edc:mask="0x1" edc:name="SE14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE15" edc:desc="" edc:mask="0x1" edc:name="SE15" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEGEN8" edc:desc="" edc:mask="0x1" edc:name="SEGEN8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEGEN9" edc:desc="" edc:mask="0x1" edc:name="SEGEN9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEGEN10" edc:desc="" edc:mask="0x1" edc:name="SEGEN10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEGEN11" edc:desc="" edc:mask="0x1" edc:name="SEGEN11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEGEN12" edc:desc="" edc:mask="0x1" edc:name="SEGEN12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEGEN13" edc:desc="" edc:mask="0x1" edc:name="SEGEN13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEGEN14" edc:desc="" edc:mask="0x1" edc:name="SEGEN14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEGEN15" edc:desc="" edc:mask="0x1" edc:name="SEGEN15" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="SE08" edc:desc="" edc:mask="0x1" edc:name="SE08" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE09" edc:desc="" edc:mask="0x1" edc:name="SE09" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDSE2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDSE2" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDSE2" edc:desc="" edc:mask="0xff" edc:name="LCDSE2" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SE16" edc:desc="" edc:mask="0x1" edc:name="SE16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE17" edc:desc="" edc:mask="0x1" edc:name="SE17" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE18" edc:desc="" edc:mask="0x1" edc:name="SE18" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE19" edc:desc="" edc:mask="0x1" edc:name="SE19" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE20" edc:desc="" edc:mask="0x1" edc:name="SE20" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE21" edc:desc="" edc:mask="0x1" edc:name="SE21" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE22" edc:desc="" edc:mask="0x1" edc:name="SE22" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE23" edc:desc="" edc:mask="0x1" edc:name="SE23" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEGEN16" edc:desc="" edc:mask="0x1" edc:name="SEGEN16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEGEN17" edc:desc="" edc:mask="0x1" edc:name="SEGEN17" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEGEN18" edc:desc="" edc:mask="0x1" edc:name="SEGEN18" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEGEN19" edc:desc="" edc:mask="0x1" edc:name="SEGEN19" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEGEN20" edc:desc="" edc:mask="0x1" edc:name="SEGEN20" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEGEN21" edc:desc="" edc:mask="0x1" edc:name="SEGEN21" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEGEN22" edc:desc="" edc:mask="0x1" edc:name="SEGEN22" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEGEN23" edc:desc="" edc:mask="0x1" edc:name="SEGEN23" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDSE3" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDSE3" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDSE3" edc:desc="" edc:mask="0xff" edc:name="LCDSE3" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SE24" edc:desc="" edc:mask="0x1" edc:name="SE24" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE25" edc:desc="" edc:mask="0x1" edc:name="SE25" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE26" edc:desc="" edc:mask="0x1" edc:name="SE26" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE27" edc:desc="" edc:mask="0x1" edc:name="SE27" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE28" edc:desc="" edc:mask="0x1" edc:name="SE28" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE29" edc:desc="" edc:mask="0x1" edc:name="SE29" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE30" edc:desc="" edc:mask="0x1" edc:name="SE30" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE31" edc:desc="" edc:mask="0x1" edc:name="SE31" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEGEN24" edc:desc="" edc:mask="0x1" edc:name="SEGEN24" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEGEN25" edc:desc="" edc:mask="0x1" edc:name="SEGEN25" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEGEN26" edc:desc="" edc:mask="0x1" edc:name="SEGEN26" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEGEN27" edc:desc="" edc:mask="0x1" edc:name="SEGEN27" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEGEN28" edc:desc="" edc:mask="0x1" edc:name="SEGEN28" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEGEN29" edc:desc="" edc:mask="0x1" edc:name="SEGEN29" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEGEN30" edc:desc="" edc:mask="0x1" edc:name="SEGEN30" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEGEN31" edc:desc="" edc:mask="0x1" edc:name="SEGEN31" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDSE4" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDSE4" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDSE4" edc:desc="" edc:mask="0xff" edc:name="LCDSE4" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SE32" edc:desc="" edc:mask="0x1" edc:name="SE32" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE33" edc:desc="" edc:mask="0x1" edc:name="SE33" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE34" edc:desc="" edc:mask="0x1" edc:name="SE34" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE35" edc:desc="" edc:mask="0x1" edc:name="SE35" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE36" edc:desc="" edc:mask="0x1" edc:name="SE36" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE37" edc:desc="" edc:mask="0x1" edc:name="SE37" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE38" edc:desc="" edc:mask="0x1" edc:name="SE38" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE39" edc:desc="" edc:mask="0x1" edc:name="SE39" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEGEN32" edc:desc="" edc:mask="0x1" edc:name="SEGEN32" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEGEN33" edc:desc="" edc:mask="0x1" edc:name="SEGEN33" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEGEN34" edc:desc="" edc:mask="0x1" edc:name="SEGEN34" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEGEN35" edc:desc="" edc:mask="0x1" edc:name="SEGEN35" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEGEN36" edc:desc="" edc:mask="0x1" edc:name="SEGEN36" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEGEN37" edc:desc="" edc:mask="0x1" edc:name="SEGEN37" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEGEN38" edc:desc="" edc:mask="0x1" edc:name="SEGEN38" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEGEN39" edc:desc="" edc:mask="0x1" edc:name="SEGEN39" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDSE5" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDSE5" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDSE5" edc:desc="" edc:mask="0xff" edc:name="LCDSE5" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SE40" edc:desc="" edc:mask="0x1" edc:name="SE40" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE41" edc:desc="" edc:mask="0x1" edc:name="SE41" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE42" edc:desc="" edc:mask="0x1" edc:name="SE42" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE43" edc:desc="" edc:mask="0x1" edc:name="SE43" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE44" edc:desc="" edc:mask="0x1" edc:name="SE44" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE45" edc:desc="" edc:mask="0x1" edc:name="SE45" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE46" edc:desc="" edc:mask="0x1" edc:name="SE46" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE47" edc:desc="" edc:mask="0x1" edc:name="SE47" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEGEN40" edc:desc="" edc:mask="0x1" edc:name="SEGEN40" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEGEN41" edc:desc="" edc:mask="0x1" edc:name="SEGEN41" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEGEN42" edc:desc="" edc:mask="0x1" edc:name="SEGEN42" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEGEN43" edc:desc="" edc:mask="0x1" edc:name="SEGEN43" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEGEN44" edc:desc="" edc:mask="0x1" edc:name="SEGEN44" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEGEN45" edc:desc="" edc:mask="0x1" edc:name="SEGEN45" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEGEN46" edc:desc="" edc:mask="0x1" edc:name="SEGEN46" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEGEN47" edc:desc="" edc:mask="0x1" edc:name="SEGEN47" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA0" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDDATA0" edc:desc="" edc:mask="0xff" edc:name="LCDDATA0" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="S0C0" edc:desc="" edc:mask="0x1" edc:name="S0C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S1C0" edc:desc="" edc:mask="0x1" edc:name="S1C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S2C0" edc:desc="" edc:mask="0x1" edc:name="S2C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S3C0" edc:desc="" edc:mask="0x1" edc:name="S3C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S4C0" edc:desc="" edc:mask="0x1" edc:name="S4C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S5C0" edc:desc="" edc:mask="0x1" edc:name="S5C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S6C0" edc:desc="" edc:mask="0x1" edc:name="S6C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S7C0" edc:desc="" edc:mask="0x1" edc:name="S7C0" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEG0COM0" edc:desc="" edc:mask="0x1" edc:name="SEG0COM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG1COM0" edc:desc="" edc:mask="0x1" edc:name="SEG1COM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG2COM0" edc:desc="" edc:mask="0x1" edc:name="SEG2COM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG3COM0" edc:desc="" edc:mask="0x1" edc:name="SEG3COM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG4COM0" edc:desc="" edc:mask="0x1" edc:name="SEG4COM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG5COM0" edc:desc="" edc:mask="0x1" edc:name="SEG5COM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG6COM0" edc:desc="" edc:mask="0x1" edc:name="SEG6COM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG7COM0" edc:desc="" edc:mask="0x1" edc:name="SEG7COM0" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="S00C0" edc:desc="" edc:mask="0x1" edc:name="S00C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S01C0" edc:desc="" edc:mask="0x1" edc:name="S01C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S02C0" edc:desc="" edc:mask="0x1" edc:name="S02C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S03C0" edc:desc="" edc:mask="0x1" edc:name="S03C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S04C0" edc:desc="" edc:mask="0x1" edc:name="S04C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S05C0" edc:desc="" edc:mask="0x1" edc:name="S05C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S06C0" edc:desc="" edc:mask="0x1" edc:name="S06C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S07C0" edc:desc="" edc:mask="0x1" edc:name="S07C0" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA1" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDDATA1" edc:desc="" edc:mask="0xff" edc:name="LCDDATA1" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="S8C0" edc:desc="" edc:mask="0x1" edc:name="S8C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S9C0" edc:desc="" edc:mask="0x1" edc:name="S9C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S10C0" edc:desc="" edc:mask="0x1" edc:name="S10C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S11C0" edc:desc="" edc:mask="0x1" edc:name="S11C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S12C0" edc:desc="" edc:mask="0x1" edc:name="S12C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S13C0" edc:desc="" edc:mask="0x1" edc:name="S13C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S14C0" edc:desc="" edc:mask="0x1" edc:name="S14C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S15C0" edc:desc="" edc:mask="0x1" edc:name="S15C0" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEG8COM0" edc:desc="" edc:mask="0x1" edc:name="SEG8COM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG9COM0" edc:desc="" edc:mask="0x1" edc:name="SEG9COM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG10COM0" edc:desc="" edc:mask="0x1" edc:name="SEG10COM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG11COM0" edc:desc="" edc:mask="0x1" edc:name="SEG11COM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG12COM0" edc:desc="" edc:mask="0x1" edc:name="SEG12COM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG13COM0" edc:desc="" edc:mask="0x1" edc:name="SEG13COM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG14COM0" edc:desc="" edc:mask="0x1" edc:name="SEG14COM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG15COM0" edc:desc="" edc:mask="0x1" edc:name="SEG15COM0" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="S08C0" edc:desc="" edc:mask="0x1" edc:name="S08C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S09C0" edc:desc="" edc:mask="0x1" edc:name="S09C0" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA2" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDDATA2" edc:desc="" edc:mask="0xff" edc:name="LCDDATA2" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="S16C0" edc:desc="" edc:mask="0x1" edc:name="S16C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S17C0" edc:desc="" edc:mask="0x1" edc:name="S17C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S18C0" edc:desc="" edc:mask="0x1" edc:name="S18C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S19C0" edc:desc="" edc:mask="0x1" edc:name="S19C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S20C0" edc:desc="" edc:mask="0x1" edc:name="S20C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S21C0" edc:desc="" edc:mask="0x1" edc:name="S21C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S22C0" edc:desc="" edc:mask="0x1" edc:name="S22C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S23C0" edc:desc="" edc:mask="0x1" edc:name="S23C0" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEG16COM0" edc:desc="" edc:mask="0x1" edc:name="SEG16COM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG17COM0" edc:desc="" edc:mask="0x1" edc:name="SEG17COM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG18COM0" edc:desc="" edc:mask="0x1" edc:name="SEG18COM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG19COM0" edc:desc="" edc:mask="0x1" edc:name="SEG19COM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG20COM0" edc:desc="" edc:mask="0x1" edc:name="SEG20COM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG21COM0" edc:desc="" edc:mask="0x1" edc:name="SEG21COM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG22COM0" edc:desc="" edc:mask="0x1" edc:name="SEG22COM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG23COM0" edc:desc="" edc:mask="0x1" edc:name="SEG23COM0" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
